app/views/questions/_form.html.erb

SELECT `polls`.* FROM `polls`
---
    <%= f.label :Dialekse_poll %><br>
    <%= f.collection_select(:poll_id, Poll.all, :id, :name) %>