app/views/results/_form.html.erb

SELECT `answers`.* FROM `answers`  WHERE `answers`.`question_id` = 41
---
  </div>
  <% @answers = Answer.where(:question_id => a.id)   %>