app/views/results/ena.html.erb

  </div>
  <% @answers = Answer.where(:question_id => a.id)   %>
---
SELECT `answers`.* FROM `answers`  WHERE `answers`.`question_id` = 41