app/controllers/answers_controller.rb

  def index
    if params[:question_id]
      @answers = Answer.where(:question_id => params[:question_id])
    else
      @answers = Answer.all
---
SELECT `answers`.* FROM `answers`  WHERE `answers`.`question_id` = 38
SELECT `answers`.* FROM `answers`

  def create
    @answer = Answer.new(answer_params)
    @question = Question.find(params[:question_id])
    @answer.question_id = @question.id
    respond_to do |format|
      if @answer.save
        QuestionAswer.create(:question_id => params[:question_id], :answer_id => @answer.id)  #Lathos sto onoma tou modelou
---
SELECT  `questions`.* FROM `questions`  WHERE `questions`.`id` = 38 LIMIT 1
INSERT INTO `answers` (`created_at`, `name`, `question_id`, `updated_at`) VALUES ('2014-09-30 13:06:04', '1', 38, '2014-09-30 13:06:04')
INSERT INTO `question_aswers` (`answer_id`, `created_at`, `question_id`, `updated_at`) VALUES (2, '2014-09-30 13:07:16', 38, '2014-09-30 13:07:16')

  def destroy
    @answer.destroy
---
DELETE FROM `answers` WHERE `answers`.`id` = 2

    def set_answer
      @answer = Answer.find(params[:id])
---
SELECT  `answers`.* FROM `answers`  WHERE `answers`.`id` = 2 LIMIT 1