app/controllers/poll_questions_controller.rb

SELECT `polls`.* FROM `polls`  WHERE `polls`.`id` = 9
SELECT `poll_questions`.* FROM `poll_questions`  WHERE `poll_questions`.`poll_id` = 9
SELECT `questions`.* FROM `questions`  WHERE `questions`.`id` IN (SELECT `poll_questions`.`id` FROM `poll_questions`  WHERE `poll_questions`.`poll_id` = 9)
SELECT `questions`.* FROM `questions`  WHERE `questions`.`id` = 38
SELECT `answers`.* FROM `answers`  WHERE `answers`.`question_id` = 41
---
  def index
  	if params[:poll_id]
  		@poll = Poll.where(:id => params[:poll_id]) #To prwto einai ston pinaka kai to params auto pou pernw.Ginete kai alliws des index controller poll
  		@a = PollQuestion.where(:poll_id => params[:poll_id]) #Exw parei polla antikeimena me to idio poll_id kai diaforetika question_id
  		@a.each do |a|  ####  MALLON den xreiazete autos o pinakas, tzampa ton ekana kai efaga tosi wra....
  		#@question = Question.where(:poll_id => params[:poll_id])  ### Giati ginetai kai etsi
  		@question = Question.where(:poll_id => a.poll_id)
  		end
  		@question.each do |a|
  		  @answers = Answer.where(:question_id => a.id)