app/controllers/polls_controller.rb

  def index
    @polls = Poll.all
---
SELECT `polls`.* FROM `polls`

  def create
    @poll = Poll.new(poll_params)
    @poll.user_id = current_user.id
    respond_to do |format|
      if @poll.save
---
INSERT INTO `polls` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2014-10-07 07:10:04', 'Neo', '2014-10-07 07:10:04', 6)

  def destroy
    @poll.destroy
---
DELETE FROM `polls` WHERE `polls`.`id` = 1

    def set_poll
      @poll = Poll.find(params[:id])
---
SELECT  `polls`.* FROM `polls`  WHERE `polls`.`id` = 1 LIMIT 1