app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions`  WHERE `questions`.`poll_id` = 1
SELECT  `polls`.* FROM `polls`  WHERE `polls`.`id` = 4 LIMIT 1
SELECT `questions`.* FROM `questions`
---
  def index
    if params[:poll_id]
      @questions = Question.where(:poll_id => params[:poll_id])
      @poll = Poll.find(params[:poll_id])
    else
      @questions = Question.all

SELECT  `polls`.* FROM `polls`  WHERE `polls`.`id` = 4 LIMIT 1
INSERT INTO `poll_questions` (`created_at`, `poll_id`, `question_id`, `updated_at`) VALUES ('2014-09-30 07:42:06', 5, 27, '2014-09-30 07:42:06')
INSERT INTO `questions` (`created_at`, `name`, `poll_id`, `updated_at`, `user_id`) VALUES ('2014-09-29 08:42:24', 'afcafcaa', 1, '2014-09-29 08:42:24', 6)
---
  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id
    @poll = Poll.find(params[:poll_id]) #Pernw to param apo to submit button kai vriskw to poll
    @question.poll_id = @poll.id #Pernw to id tou poll pou vrika apo panw
    respond_to do |format|
      if @question.save

DELETE FROM `questions` WHERE `questions`.`id` = 3
---
  def destroy
    @question.destroy