app/controllers/results_controller.rb

  def index
    @results = Result.all
---
SELECT `results`.* FROM `results`

  def new
    @result = Result.new
    if params[:poll_id]
      #@result.poll_id = params[:poll_id]
      @poll = Poll.where(:id => params[:poll_id]) #To prwto einai ston pinaka kai to params auto pou pernw.Ginete kai alliws des index controller poll
      @a = PollQuestion.where(:poll_id => params[:poll_id]) #Exw parei polla antikeimena me to idio poll_id kai diaforetika question_id
      @a.each do |a|  ####  MALLON den xreiazete autos o pinakas, tzampa ton ekana kai efaga tosi wra....
      #@question = Question.where(:poll_id => params[:poll_id])  ### Giati ginetai kai etsi
      @question = Question.where(:poll_id => a.poll_id)
      end
      @question.each do |a|
        @answers = Answer.where(:question_id => a.id)
---
SELECT `polls`.* FROM `polls`  WHERE `polls`.`id` = 9
SELECT `poll_questions`.* FROM `poll_questions`  WHERE `poll_questions`.`poll_id` = 9
SELECT `questions`.* FROM `questions`  WHERE `questions`.`poll_id` = 9
SELECT `answers`.* FROM `answers`  WHERE `answers`.`question_id` = 41

  def ena
    @result = Result.new
    if params[:poll_id]
      #@result.poll_id = params[:poll_id]
      @poll = Poll.where(:id => params[:poll_id]) #To prwto einai ston pinaka kai to params auto pou pernw.Ginete kai alliws des index controller poll
      @a = PollQuestion.where(:poll_id => params[:poll_id]) #Exw parei polla antikeimena me to idio poll_id kai diaforetika question_id
---
SELECT `polls`.* FROM `polls`  WHERE `polls`.`id` = 9
SELECT `poll_questions`.* FROM `poll_questions`  WHERE `poll_questions`.`poll_id` = 9
SELECT `questions`.* FROM `questions`  WHERE `questions`.`poll_id` = 9

  def create
    @result = Result.new(result_params)
    @result.user_id = current_user.id   #dinw sto apotelesma ton user pou to ekane
    @result.poll_id = params[:poll_id] #Den stelnw pisw to poll_id opote den douleuei
    respond_to do |format|
      if @result.save
---
INSERT INTO `results` (`answer_id`, `created_at`, `question_id`, `updated_at`, `user_id`) VALUES (2, '2014-10-02 16:00:53', 2, '2014-10-02 16:00:53', 6)

  def destroy
    @result.destroy
---
DELETE FROM `results` WHERE `results`.`id` = 3

    def set_result
      @result = Result.find(params[:id])
---
SELECT  `results`.* FROM `results`  WHERE `results`.`id` = 3 LIMIT 1